# GetLightShapeStyle Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightFamily..::..GetLightShapeStyle Method
LightFamily Class See Also
---
Returns a LightShapeStyle value for the light shape
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public LightShapeStyle GetLightShapeStyle()
```

Visual Basic
---
```text
Public Function GetLightShapeStyle As LightShapeStyle
```

Visual C++
---
```text
public:
LightShapeStyle GetLightShapeStyle()
```

# See Also
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace